; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=192, out_folder=./training, instance_id=24, seed=2048, goal_proportion=0.03

(define (problem blocksworld-24)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 - object)
 (:init 
    (arm-empty)
    (clear b95)
    (on b95 b139)
    (on b139 b108)
    (on b108 b79)
    (on-table b79)
    (clear b127)
    (on-table b127)
    (clear b125)
    (on b125 b3)
    (on-table b3)
    (clear b51)
    (on b51 b20)
    (on b20 b64)
    (on b64 b122)
    (on-table b122)
    (clear b126)
    (on-table b126)
    (clear b38)
    (on b38 b183)
    (on b183 b6)
    (on b6 b102)
    (on b102 b22)
    (on-table b22)
    (clear b19)
    (on-table b19)
    (clear b39)
    (on b39 b57)
    (on b57 b48)
    (on b48 b178)
    (on b178 b149)
    (on b149 b26)
    (on b26 b71)
    (on-table b71)
    (clear b185)
    (on b185 b55)
    (on b55 b115)
    (on b115 b147)
    (on b147 b87)
    (on b87 b33)
    (on b33 b83)
    (on b83 b112)
    (on b112 b186)
    (on b186 b153)
    (on b153 b43)
    (on b43 b192)
    (on b192 b144)
    (on b144 b77)
    (on b77 b60)
    (on b60 b166)
    (on-table b166)
    (clear b154)
    (on b154 b94)
    (on b94 b72)
    (on b72 b46)
    (on b46 b67)
    (on b67 b114)
    (on b114 b52)
    (on b52 b53)
    (on b53 b93)
    (on b93 b78)
    (on b78 b9)
    (on-table b9)
    (clear b18)
    (on-table b18)
    (clear b8)
    (on b8 b132)
    (on-table b132)
    (clear b99)
    (on b99 b116)
    (on b116 b68)
    (on-table b68)
    (clear b165)
    (on-table b165)
    (clear b105)
    (on-table b105)
    (clear b142)
    (on b142 b58)
    (on b58 b89)
    (on b89 b100)
    (on b100 b96)
    (on b96 b91)
    (on-table b91)
    (clear b135)
    (on b135 b107)
    (on b107 b76)
    (on b76 b164)
    (on-table b164)
    (clear b119)
    (on b119 b86)
    (on b86 b152)
    (on b152 b137)
    (on b137 b168)
    (on b168 b16)
    (on b16 b118)
    (on b118 b148)
    (on b148 b80)
    (on-table b80)
    (clear b151)
    (on b151 b44)
    (on b44 b182)
    (on b182 b111)
    (on-table b111)
    (clear b36)
    (on-table b36)
    (clear b45)
    (on b45 b103)
    (on b103 b7)
    (on-table b7)
    (clear b75)
    (on b75 b179)
    (on b179 b170)
    (on b170 b49)
    (on b49 b160)
    (on-table b160)
    (clear b161)
    (on-table b161)
    (clear b90)
    (on b90 b121)
    (on b121 b69)
    (on-table b69)
    (clear b62)
    (on b62 b141)
    (on-table b141)
    (clear b181)
    (on b181 b101)
    (on-table b101)
    (clear b136)
    (on b136 b59)
    (on-table b59)
    (clear b21)
    (on b21 b180)
    (on b180 b134)
    (on b134 b25)
    (on b25 b171)
    (on-table b171)
    (clear b104)
    (on b104 b131)
    (on b131 b109)
    (on b109 b41)
    (on b41 b12)
    (on b12 b66)
    (on b66 b70)
    (on-table b70)
    (clear b106)
    (on b106 b156)
    (on b156 b50)
    (on-table b50)
    (clear b117)
    (on b117 b138)
    (on-table b138)
    (clear b10)
    (on b10 b84)
    (on b84 b31)
    (on b31 b172)
    (on b172 b47)
    (on b47 b88)
    (on-table b88)
    (clear b143)
    (on-table b143)
    (clear b173)
    (on b173 b37)
    (on b37 b14)
    (on-table b14)
    (clear b13)
    (on b13 b191)
    (on b191 b188)
    (on-table b188)
    (clear b4)
    (on-table b4)
    (clear b123)
    (on-table b123)
    (clear b15)
    (on-table b15)
    (clear b27)
    (on-table b27)
    (clear b124)
    (on b124 b65)
    (on b65 b146)
    (on b146 b162)
    (on b162 b140)
    (on b140 b24)
    (on-table b24)
    (clear b187)
    (on b187 b130)
    (on b130 b35)
    (on b35 b5)
    (on b5 b17)
    (on b17 b177)
    (on b177 b28)
    (on b28 b189)
    (on b189 b42)
    (on b42 b175)
    (on b175 b184)
    (on b184 b82)
    (on b82 b97)
    (on b97 b81)
    (on b81 b157)
    (on-table b157)
    (clear b150)
    (on b150 b145)
    (on b145 b129)
    (on b129 b2)
    (on-table b2)
    (clear b174)
    (on b174 b120)
    (on b120 b40)
    (on b40 b30)
    (on b30 b32)
    (on b32 b159)
    (on b159 b169)
    (on b169 b113)
    (on b113 b73)
    (on b73 b110)
    (on b110 b155)
    (on-table b155)
    (clear b56)
    (on b56 b61)
    (on b61 b54)
    (on b54 b167)
    (on-table b167)
    (clear b23)
    (on b23 b34)
    (on b34 b11)
    (on-table b11)
    (clear b158)
    (on b158 b29)
    (on b29 b1)
    (on b1 b85)
    (on-table b85)
    (clear b63)
    (on b63 b92)
    (on b92 b163)
    (on b163 b176)
    (on b176 b190)
    (on b190 b98)
    (on b98 b133)
    (on b133 b128)
    (on b128 b74)
    (on-table b74))
 (:goal  (and 
    (clear b5)
    (on b5 b2)
    (on b2 b4)
    (on b4 b3)
    (on b3 b1)
    (on-table b1))))

; plan
1. (unstack b125 b3)
   deleted: (on b125 b3) (clear b125) (arm-empty)
   added: (holding b125) (clear b3)
   goals met: 0 of 6
2. (putdown b125)
   deleted: (holding b125)
   added: (clear b125) (arm-empty) (on-table b125)
   goals met: 0 of 6
3. (unstack b150 b145)
   deleted: (on b150 b145) (clear b150) (arm-empty)
   added: (holding b150) (clear b145)
   goals met: 0 of 6
4. (putdown b150)
   deleted: (holding b150)
   added: (clear b150) (arm-empty) (on-table b150)
   goals met: 0 of 6
5. (unstack b145 b129)
   deleted: (on b145 b129) (clear b145) (arm-empty)
   added: (holding b145) (clear b129)
   goals met: 0 of 6
6. (putdown b145)
   deleted: (holding b145)
   added: (clear b145) (arm-empty) (on-table b145)
   goals met: 0 of 6
7. (unstack b129 b2)
   deleted: (on b129 b2) (clear b129) (arm-empty)
   added: (holding b129) (clear b2)
   goals met: 0 of 6
8. (putdown b129)
   deleted: (holding b129)
   added: (clear b129) (arm-empty) (on-table b129)
   goals met: 0 of 6
9. (unstack b158 b29)
   deleted: (on b158 b29) (clear b158) (arm-empty)
   added: (holding b158) (clear b29)
   goals met: 0 of 6
10. (putdown b158)
   deleted: (holding b158)
   added: (clear b158) (arm-empty) (on-table b158)
   goals met: 0 of 6
11. (unstack b187 b130)
   deleted: (on b187 b130) (clear b187) (arm-empty)
   added: (holding b187) (clear b130)
   goals met: 0 of 6
12. (putdown b187)
   deleted: (holding b187)
   added: (clear b187) (arm-empty) (on-table b187)
   goals met: 0 of 6
13. (unstack b130 b35)
   deleted: (on b130 b35) (clear b130) (arm-empty)
   added: (holding b130) (clear b35)
   goals met: 0 of 6
14. (putdown b130)
   deleted: (holding b130)
   added: (clear b130) (arm-empty) (on-table b130)
   goals met: 0 of 6
15. (unstack b29 b1)
   deleted: (on b29 b1) (clear b29) (arm-empty)
   added: (holding b29) (clear b1)
   goals met: 0 of 6
16. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 0 of 6
17. (unstack b1 b85)
   deleted: (on b1 b85) (clear b1) (arm-empty)
   added: (holding b1) (clear b85)
   goals met: 0 of 6
18. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 6
19. (unstack b35 b5)
   deleted: (on b35 b5) (clear b35) (arm-empty)
   added: (holding b35) (clear b5)
   goals met: 2 of 6
20. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 2 of 6
21. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 2 of 6
22. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 3 of 6
23. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 3 of 6
24. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 4 of 6
25. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 4 of 6
26. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 5 of 6
27. (unstack b5 b17)
   deleted: (on b5 b17) (clear b5) (arm-empty)
   added: (holding b5) (clear b17)
   goals met: 4 of 6
28. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 6 of 6
